#include <stdio.h>

void main()
{
	//Ex.1-6 p.290
	////int arr[3] = { 10, 20, 30 };
	//char arr[3] = { 'A', 'B', 'C' };

	//printf("%p %p %p \n", &arr[0], &arr[1], &arr[2]);
	//printf("%p %p %p \n", arr+0, arr+1, arr+2);

	//Ex1 p.295
	//int arr1[6] = { 'A', 'B', 'C' }; //나머지는 0으로 채워졌고
	//int arr2[6] = { 0 };

	//for (int i = 0; i < 3; i++)
	//{
	//	arr2[i] = arr1[i];
	//	arr2[5 - i] = arr1[i];
	//}
	//for (int i = 0; i < 6; i++) printf("%c ", arr2[i]);

	//Ex2 10명의 학생 성적을 배열에 저장하고 총점과 평균을 구하는 프로그램 
	//int arr[10] = { 10, 20, 30, 40, 50, 60, 70, 80, 90, 100 };
	//int total = 0;

	//for (int i = 0; i < 10; i++) total += arr[i];
	//printf("Toatl %d \n", total);
	//printf("Averagae %.2lf \n", (double)total / 10);

	//Ex3. 표에서 가로 세로 합 구하기
	//int row0[3] = { 50, 20, 40 };
	//int row1[3] = { 66, 14, 40 };
	//int row2[3] = { 50, 86, 40 };
	//int row_end[3] = { 0 };
	//int col_end[3] = { 0 };

	////세로 합 구하기
	//for (int i = 0; i < 3; i++)
	//{
	//	row_end[i] = row0[i] + row1[i] + row2[i];
	//}
	//printf("세로 총합: ");
	//for (int i = 0; i < 3; i++) printf("%d ", row_end[i]);

	////가로 합 구하기
	//col_end[0] = row0[0] + row0[1] + row0[2];
	//col_end[1] = row1[0] + row1[1] + row1[2];
	//col_end[2] = row2[0] + row2[1] + row2[2];
	//printf("\n가로 총합: ");
	//for (int i = 0; i < 3; i++) printf("%d ", col_end[i]);

	//Ex4. 
	//int gugudan[9] = { 0 };
	//int dan = 0;
	//printf("\n\nEnter dan: ");
	//scanf_s("%d", &dan);
	//for (int i = 0; i < 9; i++)
	//{
	//	gugudan[i] = dan * (i + 1);
	//}
	//printf("%d Dan is ", dan);
	//for (int i = 0; i < 9; i++) printf("%d ", gugudan[i]);

	//문제1
	//길이가 5인 int형 배열을 선언해서 프로그램 사용자로부터 총 5개의 정수를 입력 받자.
	//그리고 입력이 끝나면 다음의 내용을 출력하도록 예제를 작성해보자.
	//- 입력된 정수 중에서 최대값
	//- 입력된 정수 중에서 최소값
	//- 입력된 정수의 총 합

	//단, 반드시 입력을 완료한 상태에서 '최대값'과 '최소값' 그리고 '총합'을 계산해야 한다.

	//문제2.
	//프로그램 사용자로부터 하나의 영단어를 입력 받아서 입력 받은 영단어의 길이를 계산
	//하여 출력하는 프로그램을 작성해보자.예를 들어서 "Array"라는 단어가 입력되면
	//5가 출력되어야 한다.(입력받을 수 있는 영단어의 최대 글자수가 30개까지
	//되도록 배열변수의 크기를 선언하자.)
	
	//char word[30] = { 0 };
	//for (int i = 0; i < 31; i++)
	//{
	//	if (i == 30) //맥시멈 30자임을 알리기 위해 마지막 29번 요소를 채운 뒤 다음 번 30번 째에 경고. 이를 위해 i의 최대값도 29가 아닌 30으로 조정
	//	{
	//		printf("Maximum 30 letters \n");
	//		break;
	//	}
	//	scanf_s("%c", &word[i]); //키보드 버퍼에 저장된 문자열을 scanf가 루프마다 한 자씩 뽑아간다.
	//							 //입력 중 30자가 넘어도 경고를 할 방법은 없다. 엔터를 쳐야 함수가 끝나니까.
	//	if (word[i] == 10) break; //입력 중 엔터를 누르면 멈추도록
	//}
	//for (int i = 0; i < 30; i++) printf("%c", word[i]);

	//문제3.
	//프로그램 사용자로부터 영단어을 입력 받는다.그리고 나서 입력 받은 영단어를 구성하는
	//문자 중에서 아스키 코드의 값이 가장 큰 문자를 찾아서 출력하는 프로그램을 작성해보자.
	//예를 들어서 입력된 영단어가 "LOVE"라면 이 중에서 아스키 코드 값이 가장 큰 문자는 V
	//이므로 V가 출력되어야 한다.

	char word[31] = { 0 };
	printf("Enter a word and press Enter. Maximum 30 letters \n\n");

	for (int i = 0; i < 30; i++)
	{
		scanf_s("%c", &word[i]); //키보드 버퍼에 저장된 문자열을 scanf가 루프마다 한 자씩 뽑아간다.
								 //입력 중 30자가 넘어도 경고를 할 방법은 없다. 엔터를 쳐야 함수가 끝나니까.
		if (word[i] == 10)
		{
			break; //입력 중 엔터를 누르면 멈추도록
		}
	}
	word[30] = NULL;

	printf("Input word: "); //%c로 읽을 때
	for (int i = 0; i < 30; i++) if (word[i] != 0) printf("%c", word[i]); 
	printf("\nInput word: %s \n", word); //%s로 읽을 때

	printf("Inputted ASCII: "); //입력된 문자들의 아스키값 보기
	for (int i = 0; i < 30; i++) if(word[i]!=0) printf("%d ", word[i]);

	char max = NULL; //아스키값 가장 큰 문자 저장
	for (int i = 0; i < 30; i++) max = (max > word[i]) ? max : word[i];

	printf("%c", max);
	

	//문제4.
	//프로그램 사용자로부터 영단어를 입력 받아서 char형 배열에 저장한다.그 다음 배열에
	//저장된 영단어를 역순으로 뒤집는다.물론 이 때에 널 문자의 위치를 변경해서는 안된다.
	//뒤집고 나서는 제대로 뒤집혔는지 확인하기 위해서 출력해보자.
	//(입력받을 수 있는 영단어의 최대 글자수가 30개까지 되도록 배열변수의 크기를 선언하자.)



	//문제 5.
	//아래와 같이 학생들의 성적을 받아서 평균을 구하는 프로그램을 작성해보자.
	//(단, 최대 학생수는 10명으로 제한한다.)

	//실행결과 예시)

	//학생의 수를 입력하시오 : 2

	//학생 1의 성적을 입력하세요 : 20
	//학생 2의 성적을 입력하세요 : 110
	//잘못된 성적입니다.다시 입력하시오.
	//학생 2의 성적을 입력하세요 : 30

	//성적 평균은 25.0 입니다.


	//문제 6.
	//입력값들의 분포를 시각적으로 볼 수 있는 히스토그램을 만드는 프로그램을 작성하시오.
	//이 프로그램은 1부터 100이하의 정수 10개를 읽어야 하고, 1 - 10, 11 - 20 등의 범위에 드는
	//값들의 횟수를 아래와 같이 출력하여야 한다.

	//1 - 10 : ****
	//11 - 20 : **
	//21 - 30 : *
	//31 - 40 : **
	//..........
	//..........


	//문제 7.
	//배열을 이용하여 간단한 극장 예약 시스템을 작성하여 보자.아주 작은 극장이라서 좌석이
	//10개밖에 안 된다.사용자가 예약을 하려고 하면 먼저 좌석 배치표를 보여준다.즉, 예약이
	//끝난 좌석은 1로, 예약이 안된 좌석은 0으로 나타낸다.


	//좌석을 예약하시겠습니까(1(Y)또는 0(N)) ? 1

	//현재의 예약 상태는 다음과 같습니다.
	//---------------------- -
	//좌석 번호 : 1  2  3  4  5  6  7  8  9  10
	//---------------------- -
	//예약 상태 : 0  0  0  0  0  1  1  1  0   1


	//몇번째 좌석을 예약하시겠습니까 ? 6
	//죄송합니다.이미 예약된 좌석입니다.다른 좌석을 선택해 주세요.

	//몇번째 좌석을 예약하시겠습니까 ? 1
	//1번 좌석 예약되었습니다.

	//좌석을 예약하시겠습니까(1(Y)또는 0(N)) ? 0
	//예약을 종료합니다.


	//문제 8.
	//첫번째 배열 arr1은{ 10, 20, 30, 40, 50 }의 정수형 요소값을 가지고 있다.
	//두번째 배열 arr2은{ 1,  2,  3,  4,  5 }의 정수형 요소값을 가지고 있다.
	//세번째 배열 arr3의 요소값은 arr1의 요소와 arr2의 요소값을 차례로 덧셈한
	//결과를 저장하도록 프로그래밍 해보자.단 arr2의 요소는 역순으로 더해지도록 하자.
	//즉, arr1의 0번 요소와 arr2의 4번 요소를 더해서 arr3의 0번 요소에 대입하도록 해야한다.
	//arr3의 1번 요소에는 arr1의 1번 요소와 arr2의 3번 요소가 더해져야 한다는 것이다.

	//이렇게 arr3의 요소값을 모두 대입하고 그 값을 차례대로 출력해보자.


	//문제 9.
	//길이가 25인 정수형 배열을 만들어라.그리고 이 배열의 각 요소에 1부터 25까지 25개의 정수값이
	//Random하게 저장되도록 프로그래밍 하시오.단, 배열안에 저장된 Random값은 중복된 숫자가
	//있으면 안된다.값들이 제대로 대입되어 있는지 알아보기 위해 1줄에 5개씩 5줄로 각 배열의 요소를
	//인덱스 순서대로 출력해보자.


	//문제 10.
	//위의 9번 문제를 가로 5, 세로 5인 2차원 배열로 만들어 보자.


	//문제 11.
	//5 * 5크기의 Metrix에 나선형으로 숫자를 출력하는 프로그램을 작성해 보자.
	//가로가 5, 세로가 5인 matrix에 1부터 25까지의 숫자를 나선형으로 저장하는 프로그램으로
	//2차원 배열 buf[5][5]에 아래의 결과처럼 나오도록 각 배열요소에 값을 저장하는 프로그램
	//이다.

	//1  16  15  14  13
	//2  17  24  23  12
	//3  18  25  22  11
	//4  19  20  21  10
	//5   6   7   8   9


	//배열의 값을 출력하는 함수는 아래와 같다.이 함수는 변경하지 못한다.

	//	void Display(void)
	//{
	//	int i, j;

	//	for (i = 0; i < 5; i++)
	//	{
	//		for (j = 0; j < 5; j++)
	//		{
	//			printf("%3d\t", buf[i][j]);
	//		}
	//		printf("\n");
	//	}
	//}




}